app/views/irrigation_events/new.html.erb

		<%= form.label :zone_id %>
		<%= form.collection_select :zone_id, Zone.all, :id, :name, prompt: "Select a zone" %>
---
SELECT "zones".* FROM "zones"