app/controllers/home_controller.rb

  def index
     @zones = Zone.all
     @sensor_readings = SensorReading.last
     @irrigation_events = IrrigationEvent.all
---
SELECT "zones".* FROM "zones"
SELECT "sensor_readings".* FROM "sensor_readings" ORDER BY "sensor_readings"."id" DESC LIMIT 1
SELECT "irrigation_events".* FROM "irrigation_events"