app/controllers/irrigation_events_controller.rb

SELECT "irrigation_events".* FROM "irrigation_events"
---
  def index
    @irrigation_events = IrrigationEvent.all

SELECT "irrigation_events".* FROM "irrigation_events"
---
  def tasks
    current_time = Time.current

# Fetch all events from the database
all_events = IrrigationEvent.all

# Filter ongoing events: started but not yet finished
@ongoing_events = all_events.select do |event|

INSERT INTO "irrigation_events" ("zone_id", "duration", "created_at", "updated_at") VALUES (1, 5, '2024-12-14 20:30:10.787242', '2024-12-14 20:30:10.787242') RETURNING "id"
---
  def create
    @irrigation_event = IrrigationEvent.new(event_params)

    if @irrigation_event.save