app/controllers/zones_controller.rb

SELECT "zones".* FROM "zones"
---
  def index
    @zones = Zone.all